RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_spi.c
    if (is_slave)
    {
        mosi_map = _CYHAL_SCB_FIND_MAP_BLOCK(mosi, cyhal_pin_map_scb_spi_s_mosi, cfg->resource);
        miso_map = _CYHAL_SCB_FIND_MAP_BLOCK(miso, cyhal_pin_map_scb_spi_s_miso, cfg->resource);
        sclk_map = _CYHAL_SCB_FIND_MAP_BLOCK(sclk, cyhal_pin_map_scb_spi_s_clk, cfg->resource);
        mosi_dm = CYHAL_PIN_MAP_DRIVE_MODE_SCB_SPI_S_MOSI;
        miso_dm = CYHAL_PIN_MAP_DRIVE_MODE_SCB_SPI_S_MISO;
        sclk_dm = CYHAL_PIN_MAP_DRIVE_MODE_SCB_SPI_S_CLK;
        result = _cyhal_spi_get_ssel_map_idx(ssel, &ssel_map, &active_ssel, cfg->resource);
    }
    else
    {
        mosi_map = _CYHAL_SCB_FIND_MAP_BLOCK(mosi, cyhal_pin_map_scb_spi_m_mosi, cfg->resource);
        miso_map = _CYHAL_SCB_FIND_MAP_BLOCK(miso, cyhal_pin_map_scb_spi_m_miso, cfg->resource);
        sclk_map = _CYHAL_SCB_FIND_MAP_BLOCK(sclk, cyhal_pin_map_scb_spi_m_clk, cfg->resource);
        mosi_dm = CYHAL_PIN_MAP_DRIVE_MODE_SCB_SPI_M_MOSI;
        miso_dm = CYHAL_PIN_MAP_DRIVE_MODE_SCB_SPI_M_MISO;
        sclk_dm = CYHAL_PIN_MAP_DRIVE_MODE_SCB_SPI_M_CLK;
        /* No need to find maps for ssel pins, as GPIO used */
    }

    const cyhal_resource_pin_mapping_t *base_map = (NC != mosi)
        ? (mosi_map != NULL ? mosi_map : NULL)
        : (miso_map != NULL ? miso_map : NULL);

    /* Validate pins mapping */
    if (NULL == base_map ||
        ((NC != mosi) && ((NULL == mosi_map) || !_cyhal_utils_map_resources_equal(base_map, mosi_map))) ||
        ((NC != miso) && ((NULL == miso_map) || !_cyhal_utils_map_resources_equal(base_map, miso_map))) ||
        ((NC != sclk) && ((NULL == sclk_map) || !_cyhal_utils_map_resources_equal(base_map, sclk_map))) ||
        ((is_slave) && ((NC != ssel) && ((NULL == ssel_map) || !_cyhal_utils_map_resources_equal(base_map, ssel_map)))))
    {
        return CYHAL_SPI_RSLT_ERR_INVALID_PIN;
    }

    const cyhal_resource_inst_t default_spi_inst = { CYHAL_RSC_SCB, base_map->block_num, base_map->channel_num };
    const cyhal_resource_inst_t* spi_int_p = (obj->dc_configured)
        ? cfg->resource
        : &default_spi_inst;

    if (CY_RSLT_SUCCESS == result)
    {
        if (false == obj->dc_configured)
        {
            result = cyhal_hwmgr_reserve(spi_int_p);
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        obj->resource = *spi_int_p;
        obj->base = _CYHAL_SCB_BASE_ADDRESSES[obj->resource.block_num];
    }

    // reserve the MOSI pin
    if ((result == CY_RSLT_SUCCESS) && (NC != mosi))
    {
        if (false == obj->dc_configured)
        {
            result = _cyhal_utils_reserve_and_connect(mosi_map, mosi_dm);
        }
        if (result == CY_RSLT_SUCCESS)
        {
            obj->pin_mosi = mosi;
        }
    }

    // reserve the MISO pin
    if ((result == CY_RSLT_SUCCESS) && (NC != miso))
    {
        if (false == obj->dc_configured)
        {
            result = _cyhal_utils_reserve_and_connect(miso_map, miso_dm);
        }
        if (result == CY_RSLT_SUCCESS)
        {
            obj->pin_miso = miso;
        }
    }

    // reserve the SCLK pin
    if (result == CY_RSLT_SUCCESS && (NC != sclk))
    {
        if (false == obj->dc_configured)
        {
            result = _cyhal_utils_reserve_and_connect(sclk_map, sclk_dm);
        }
        if (result == CY_RSLT_SUCCESS)
        {
            obj->pin_sclk = sclk;
        }
    }

    // reserve and configure the SSEL pin
    if ((result == CY_RSLT_SUCCESS) && (NC != ssel))
    {
        result = _cyhal_spi_ssel_config(obj, ssel,
                    (cyhal_spi_ssel_polarity_t)((cfg->config->ssPolarity >> found_cfg_ssel_pos) & 0x1), !obj->dc_configured);
    }

    if (result == CY_RSLT_SUCCESS)
    {
        if (cfg->clock == NULL)
        {
            result = _cyhal_utils_allocate_clock(&(obj->clock), &(obj->resource), CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT, true);
            obj->alloc_clock = true;
        }
        else
        {
            obj->clock = *cfg->clock;
            obj->alloc_clock = false;

            /* Per CDT 315848 and 002-20730 Rev. *E:
             * For SPI, an integer clock divider must be used for both master and slave. */
            if ((obj->clock.block == CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT) || (obj->clock.block == CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT))
            {
                result = CYHAL_SPI_RSLT_CLOCK_NOT_SUPPORTED;
            }
        }
    }
    if (result == CY_RSLT_SUCCESS)
    {
        result = _cyhal_utils_peri_pclk_assign_divider(_cyhal_scb_get_clock_index(obj->resource.block_num), &(obj->clock));

        if ((result == CY_RSLT_SUCCESS) && obj->alloc_clock)
        {
            result = _cyhal_spi_int_frequency(obj, _CYHAL_SPI_DEFAULT_SPEED, &ovr_sample_val);
        }
    }

    if (result == CY_RSLT_SUCCESS)
    {
        _cyhal_scb_update_instance_data(obj->resource.block_num, (void*)obj, &_cyhal_spi_pm_callback_instance);
        if ((false == obj->dc_configured) && obj->alloc_clock)
        {
            cfg_local.oversample = ovr_sample_val;
        }
        obj->oversample_value = cfg_local.oversample;
        obj->data_bits = cfg_local.txDataWidth;
        obj->msb_first = cfg_local.enableMsbFirst;
        obj->clk_mode = cfg_local.sclkMode;
        obj->mode = (uint8_t) _cyhal_spi_mode_pdl_to_hal(&cfg_local);

        result = (cy_rslt_t)Cy_SCB_SPI_Init(obj->base, &cfg_local, &(obj->context));
    }

    if (result == CY_RSLT_SUCCESS)
    {
        /* Activating specified by user ssel after init */
        if (NC != ssel)
        {
            result = cyhal_spi_select_active_ssel(obj, ssel);

            /* Configuring rest of provided ssel signals */
            size_t ssel_idx = found_cfg_ssel_pos;
            while ((result == CY_RSLT_SUCCESS) && ((ssel_idx + 1) < sizeof(cfg->gpios.ssel) / sizeof(cfg->gpios.ssel[0])))
            {
                ++ssel_idx;
                if (NC != cfg->gpios.ssel[ssel_idx])
                {
                    result = _cyhal_spi_ssel_config(obj, cfg->gpios.ssel[ssel_idx],
                                        (cyhal_spi_ssel_polarity_t)((cfg->config->ssPolarity >> ssel_idx) & 0x1),
                                        !obj->dc_configured);
                }
            }
        }
    }

    if (result == CY_RSLT_SUCCESS)
    {
        obj->callback_data.callback = NULL;
        obj->callback_data.callback_arg = NULL;
        obj->irq_cause = 0;

